frontend/controllers/ArchivoController.php

    public function actionIndex() {
        if (isset(Yii::$app->session['c_titulo'])) {
            $c_titulo = Yii::$app->session['c_titulo'];
        } else {
            $c_titulo = 'null';
        }
        $searchModel = new ArchivoSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $model = new Archivo();
        $tipoArchivo = ArrayHelper::map(Tipoarchivo::find()->orderBy('tar_tipo')->all(), 'tar_id', 'tar_tipo');
---
SELECT * FROM `tipo_archivo` ORDER BY `tar_tipo`

    public function actionView($id) {
        if (isset(Yii::$app->session['c_titulo'])) {
            $c_titulo = Yii::$app->session['c_titulo'];
        } else {
            $c_titulo = 'null';
        }

        if (Detallearchivoatributoex::find()->where(['arc_id' => $id])->count() != 0) {
            //Se crea un array para el modelo de coleccion-pais
            $detalleAE = Detallearchivoatributoex::find()->where(['arc_id' => $id])->all();
---
SELECT COUNT(*) FROM `detallearchivo_atributoex` WHERE `arc_id`='37'
SELECT * FROM `detallearchivo_atributoex` WHERE `arc_id`='37'

    public function actionCreate() {

        $session = Yii::$app->session;
        $tar_id = $session['tipo_archivo_seleccionado'];

        $tipo = 1;

        if (isset(Yii::$app->session['c_id'])) {
            $c_id = Yii::$app->session['c_id'];
        } else {
            $c_id = 'null';
        }

        //Se cargan los valores iniciales de las siguinetes variables
        $model = new Archivo();
        $atributoExtra = [new Atributoextra()];
        //$inv = Investigador::find()->select(['inv_id'])->where(['usu_id'=>Yii::$app->user->identity->id])->one();
        $pais = ArrayHelper::map(Pais::find()->orderBy('pai_nombre')->all(), 'pai_id', 'pai_nombre');
        $genero = ArrayHelper::map(Genero::find()->orderBy('gen_nombre')->all(), 'gen_id', 'gen_nombre');
        $idioma = ArrayHelper::map(Idioma::find()->orderBy('idi_nombre')->all(), 'idi_id', 'idi_nombre');
        $derecho = ArrayHelper::map(Derecho::find()->orderBy('der_nombre')->all(), 'der_id', 'der_nombre');


        $ta = Archivoatributoex::find()->select(['aex_id'])->where(['tar_id' => $tar_id])->all();
        $ae = ArrayHelper::map(Atributoextra::findAll($ta), 'aex_id', 'aex_nombre');
---
SELECT * FROM `pais` ORDER BY `pai_nombre`
SELECT * FROM `genero` ORDER BY `gen_nombre`
SELECT * FROM `idioma` ORDER BY `idi_nombre`
SELECT * FROM `derecho` ORDER BY `der_nombre`
SELECT `aex_id` FROM `archivo_atributoex` WHERE `tar_id`='5'
SELECT * FROM `atributo_extra` WHERE `aex_id` IN (5, 6)

                    }
                    //Se asigna sube el nuevo archivo
                    $contArchivo = Archivo::find()->count();
                    $archivo->saveAs('@frontend/web/img/archivo/' . $archivo->baseName . ($contArchivo + 1) . '.' . $archivo->extension);
---
UPDATE `archivo` SET `arc_archivo`='https://www.youtube.com/watch?v=noppABEk77s', `pai_id`=216, `gen_id`=1, `idi_id`=2, `der_id`=1, `arc_fechaAudit`='21-01-20 20:04:23' WHERE `arc_id`=35