frontend/views/archivo/_search.php

SELECT * FROM `tipo_archivo`
---
/* @var $model frontend\models\archivo\ArchivoSearch */
/* @var $form yii\widgets\ActiveForm */

$Datos2 = \yii\helpers\ArrayHelper::map(\backend\models\tipoarchivo\Tipoarchivo::find()->all(),'tar_id', 'tar_tipo');