dyac/backend/models/user/User.php

UPDATE `user` SET `uge_id`=3, `pai_id`=216, `rol_id`=2, `use_estado`='2', `use_fechaAudit`='21-01-07 09:56:04', `updated_at`=1610031364 WHERE `id`=8
SELECT * FROM `user` WHERE `id`=8
---
    public function signup() {

        $bandera = false;

        if (!$this->validate()) {
            return null;
        }
        if($this->id != null){
            if($this->password != null && $this->password != '' ){
                $this->setPassword($this->password);
            }
        }else{
            $this->setPassword($this->password);
        }
        if($this->auth_key == null){
            $this->generateAuthKey();
        }

        if($this->verification_token == null){
            $this->generateEmailVerificationToken();
            $this->status = self::STATUS_INACTIVE;
            $bandera = true;
        }

        if(!$this->save()){
            $this->addErrors($this->getErrors());
            return false;
        }else{
            $userEmail = User::find()->where(['id'=>$this->id])->one();