dyac/backend/controllers/ArchivoController.php

    public function actionIndex()
    {
        $searchModel = new ArchivoSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $model = new Archivo();
        $tipoArchivo  = ArrayHelper::map(Tipoarchivo::find()->orderBy('tar_tipo')->all(),'tar_id', 'tar_tipo');
---
SELECT * FROM `tipo_archivo` ORDER BY `tar_tipo`

    public function actionView($id)
    {
        $model =$this->findModel($id);
        $c_titulo = Coleccion::find()->select(['col_titulo'])->where(['col_id' => $model->col_id])->one();

        if(Detallearchivoatributoex::find()->where(['arc_id'=> $id])->count() != 0)
        {
            //Se crea un array para el modelo de coleccion-pais
            $detalleAE = Detallearchivoatributoex::find()->where(['arc_id'=> $id])->all();
---
SELECT `col_titulo` FROM `coleccion` WHERE `col_id`=48
SELECT COUNT(*) FROM `detallearchivo_atributoex` WHERE `arc_id`='33'
SELECT * FROM `detallearchivo_atributoex` WHERE `arc_id`='33'

    public function actionUpdate($id)
    {
        $tipo = 2;
        //Se busca el modelo a editar dos veces, una para que el usuario modifique
        //Y la otra para comparar las modiciaciones que se realizarón
        $model = $this->findModel($id);
        $modelAnt = $this->findModel($id);

        //Se crea las listas de las tablas que tienen relación con archivos
        $pais  = ArrayHelper::map(Pais::find()->orderBy('pai_nombre')->all(),'pai_id', 'pai_nombre');
        $genero  = ArrayHelper::map(Genero::find()->orderBy('gen_nombre')->all(),'gen_id', 'gen_nombre');
        $idioma  = ArrayHelper::map(Idioma::find()->orderBy('idi_nombre')->all(),'idi_id', 'idi_nombre');
        $derecho  = ArrayHelper::map(Derecho::find()->orderBy('der_nombre')->all(),'der_id', 'der_nombre');

        //Se buscan los atributos extra para el tipo de archivo de la colección.
        $ta = Archivoatributoex::find()->select(['aex_id'])->where(['tar_id'=>$model->tar_id])->all();
        $ae =ArrayHelper::map(Atributoextra::findAll($ta),'aex_id', 'aex_nombre');


        if(Detallearchivoatributoex::find()->where(['arc_id'=> $id])->count() != 0){
            $borrarDAAE = Detallearchivoatributoex::find()->where(['arc_id'=> $model->arc_id])->all();
            $detalleAE = Detallearchivoatributoex::find()->where(['arc_id'=> $id])->all();
        }
        else{
            $borrarDAAE = 0;
            $detalleAE = [new Detallearchivoatributoex];
        }

        //Si existen valores por el metodo POST (cuando el usuario de clic en guardar en el form)
        if ($model->load(Yii::$app->request->post())){
---
SELECT * FROM `pais` ORDER BY `pai_nombre`
SELECT * FROM `genero` ORDER BY `gen_nombre`
SELECT * FROM `idioma` ORDER BY `idi_nombre`
SELECT * FROM `derecho` ORDER BY `der_nombre`
SELECT `aex_id` FROM `archivo_atributoex` WHERE `tar_id`=2
SELECT * FROM `atributo_extra` WHERE `aex_id` IN (3, 5, 6, 7)
SELECT COUNT(*) FROM `detallearchivo_atributoex` WHERE `arc_id`='33'
SELECT * FROM `detallearchivo_atributoex` WHERE `arc_id`=33
SELECT * FROM `detallearchivo_atributoex` WHERE `arc_id`='33'
SELECT * FROM `detallearchivo_atributoex` WHERE `arc_id`='35'

                    </div>
                ');

                $col = Coleccion::find()->select(['col_titulo','inv_id'])->where(['col_id' => $model->col_id])->one();

                $inv = Investigador::find()->where(['inv_id'=>$col->inv_id])->one();
                $user = User::find()->where(['id'=>$inv->usu_id])->one();
---
SELECT `col_titulo`, `inv_id` FROM `coleccion` WHERE `col_id`=48
SELECT * FROM `investigador` WHERE `inv_id`=4
SELECT * FROM `user` WHERE `id`=4

    protected function findModel($id)
    {
        if (($model = Archivo::findOne($id)) !== null) {
---
SELECT * FROM `archivo` WHERE `arc_id`='33'