dyac/backend/controllers/ColeccionController.php

SELECT * FROM `disciplina` ORDER BY `dis_nombre`
SELECT * FROM `pais` ORDER BY `pai_nombre`
SELECT * FROM `atributo_extra` WHERE `aex_tipo`='Colección' ORDER BY `aex_nombre`
SELECT COUNT(*) FROM `coleccion_pais` WHERE `col_id`=48
SELECT * FROM `coleccion_pais` WHERE `col_id`=48
SELECT COUNT(*) FROM `palabra_clave` WHERE `col_id`=48
SELECT * FROM `palabra_clave` WHERE `col_id`=48
---
    public function actionUpdate($id)
    {
        //Obtienen los datos de la DB de disciplina, país, colaboradores
        $disciplina  = ArrayHelper::map(Disciplina::find()->orderBy('dis_nombre')->all(),'dis_id', 'dis_nombre');
        $pais  = ArrayHelper::map(Pais::find()->orderBy('pai_nombre')->all(),'pai_id', 'pai_nombre');
        $atributosExtra  = ArrayHelper::map(Atributoextra::find()->where(['aex_tipo' => 'Colección'])->orderBy('aex_nombre')->all(),'aex_id', 'aex_nombre');

        //Se busca el modelo de la coleccion a editar
        $model = $this->findModel($id);
        $modelFoto = $this->findModel($id);

        if(Coleccionpais::find()->where(['col_id'=> $model->col_id])->count() != 0)
        {
            //Se crea un array para el modelo de coleccion-pais
            $coleccionpais = Coleccionpais::find()->where(['col_id'=> $model->col_id])->all();
            $tempCP = Coleccionpais::find()->where(['col_id'=> $model->col_id])->all();
        }else{
            //Se crea un array para el modelo de coleccion-pais
            $coleccionpais = [new Coleccionpais()];
            $tempCP = [new Coleccionpais()];
        }

        if(Palabraclave::find()->where(['col_id'=> $model->col_id])->count() != 0)
        {
            //Se crea un array para el modelo de las palabras clave
            $palabraclave = Palabraclave::find()->where(['col_id'=> $model->col_id])->all();
            $tempPC = Palabraclave::find()->where(['col_id'=> $model->col_id])->all();

SELECT COUNT(*) FROM `coleccion_persona` WHERE `col_id`='50'
---
            $tempPC = [new Palabraclave()];
        }

        if(Coleccionpersona::find()->where(['col_id'=> $model->col_id])->count() != 0)

SELECT COUNT(*) FROM `coleccion_atributoex` WHERE `col_id`=48
SELECT * FROM `coleccion_atributoex` WHERE `col_id`=48
---
            $tempCPer = [new Coleccionpersona()];
        }

        if(Coleccionatributoex::find()->where(['col_id'=> $model->col_id])->count() != 0)
        {
            //Se crea un array para el modelo de las palabras clave
            $atrExtra = Coleccionatributoex::find()->where(['col_id'=> $model->col_id])->all();
            $tempAE = Coleccionatributoex::find()->where(['col_id'=> $model->col_id])->all();

SELECT * FROM `coleccion` WHERE `col_id`='48'
---
    protected function findModel($id)
    {
        if (($model = Coleccion::findOne($id)) !== null) {