dyac/backend/controllers/SiteController.php

    public function actionIndex()
    {
        $menu = Menu::find()->where(['men_activo' => 1])->andFilterWhere(['men_idPadre'=>0])->orderBy(['men_id' => SORT_DESC])->all();
        $submenu = Menu::find()->where(['men_activo' => 1])->andFilterWhere(['>','men_idPadre',0])->orderBy(['men_posicion' => SORT_ASC, 'men_id' => SORT_DESC])->all();
       /* $menu = Menu::find()->where(['men_activo' => 1])->orderBy([
            'men_idPadre' => SORT_DESC,
            'men_posicion'=>SORT_DESC,

        ])->all();*/

        //$menu = Menu::find()->where(['men_activo' => 1])->all();


        $solicitudes = User::find()->where(['rol_id' => 2])->andFilterWhere(['use_estado' => 1])->count();
        $solicitudesCol = Coleccion::find()->where(['col_estadoCol' => 'P'])->count();
        $solicitudesArc = Archivo::find()->where(['arc_estadoarc' => 'P'])->count();
---
SELECT * FROM `menu` WHERE (`men_activo`=1) AND (`men_idPadre`=0) ORDER BY `men_id` DESC
SELECT * FROM `menu` WHERE (`men_activo`=1) AND (`men_idPadre` > 0) ORDER BY `men_posicion`, `men_id` DESC
SELECT COUNT(*) FROM `user` WHERE (`rol_id`=2) AND (`use_estado`=1)
SELECT COUNT(*) FROM `coleccion` WHERE `col_estadoCol`='P'
SELECT COUNT(*) FROM `archivo` WHERE `arc_estadoarc`='P'

    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

       // $this->layout = 'blank';

        $model = new LoginForm();

        if ($model->load(Yii::$app->request->post())) {

            $user = User::find()->where(['email'=>$model->email])->andFilterWhere(['rol_id'=>1])->count();
---
SELECT COUNT(*) FROM `user` WHERE (`email`='dyac.app@gmail.com') AND (`rol_id`=1)