dyac/backend/controllers/UserController.php

    public function actionDelete($id)
    {
        //tambien falta de coleccion_persona
        $cont = Investigador::find()->where(['usu_id'=>$id])->count();
---
SELECT COUNT(*) FROM `investigador` WHERE `usu_id`='7'