frontend/models/coleccion/ColeccionSearch.php

SELECT `inv_id` FROM `investigador` WHERE `usu_id`=9
---
    public function search($params)
    {

        $model = Investigador::find()->select(['inv_id'])->where(['usu_id' => Yii::$app->user->identity->id])->one();